# IExternalApplication Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExternalApplication Methods
IExternalApplication Interface See Also
---
The IExternalApplication type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
| OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

# See Also
IExternalApplication Interface
Autodesk.Revit.UI Namespace